app/views/static_pages/detail_food.html.erb

SELECT "food_images".* FROM "food_images" WHERE "food_images"."food_id" = ?  [["food_id", 21]]
SELECT  1 AS one FROM "food_images" WHERE "food_images"."food_id" = ? LIMIT ?  [["food_id", 21], ["LIMIT", 1]]
---
		<div class="center" style="width:50%;">
			<% if !@food.food_images.empty? %>

SELECT "food_images".* FROM "food_images" WHERE "food_images"."food_id" = ?  [["food_id", 21]]
SELECT COUNT(*) FROM "food_images" WHERE "food_images"."food_id" = ?  [["food_id", 21]]
---
					<ol class="carousel-indicators">
						<% num_of_images = @food.food_images.count %>

SELECT  1 AS one FROM "food_rates" WHERE "food_rates"."food_id" = ? LIMIT ?  [["food_id", 21], ["LIMIT", 1]]
SELECT "food_rates".* FROM "food_rates" WHERE "food_rates"."food_id" = ?  [["food_id", 21]]
---
	<div class="comment">
		<% if !@food.food_rates.empty? %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
						<div class="box-comt">
							<% user = User.find_by id: rate.user_id %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
						<div class="box-comt read-more-target">
							<% user = User.find_by id: rate.user_id %>