app/views/static_pages/detail_cat.html.erb

SELECT "cat_images".* FROM "cat_images" WHERE "cat_images"."cat_id" = ?  [["cat_id", 3]]
SELECT  1 AS one FROM "cat_images" WHERE "cat_images"."cat_id" = ? LIMIT ?  [["cat_id", 3], ["LIMIT", 1]]
---
		<div class="center" style="width:50%;">
			<% if !@cat.cat_images.empty? %>

SELECT "cat_images".* FROM "cat_images" WHERE "cat_images"."cat_id" = ?  [["cat_id", 3]]
SELECT COUNT(*) FROM "cat_images" WHERE "cat_images"."cat_id" = ?  [["cat_id", 3]]
---
					<ol class="carousel-indicators">
						<% num_of_images = @cat.cat_images.count %>

SELECT  1 AS one FROM "cat_rates" WHERE "cat_rates"."cat_id" = ? LIMIT ?  [["cat_id", 2], ["LIMIT", 1]]
SELECT "cat_rates".* FROM "cat_rates" WHERE "cat_rates"."cat_id" = ?  [["cat_id", 2]]
---
			<div class="comment">
				<% if !@cat.cat_rates.empty? %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
								<div class="box-comt">
									<% user = User.find_by id: rate.user_id %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
								<div class="box-comt read-more-target">
									<% user = User.find_by id: rate.user_id %>