app/views/static_pages/home.html.erb

					<%= link_to detail_food_path(id: food.id) do %>
						<% if food.food_images.first %>
							<%= image_tag(food.food_images.first.link, style:"width:90%; height:150px; object-fit:cover") %>
---
SELECT  "food_images".* FROM "food_images" WHERE "food_images"."food_id" = ? ORDER BY "food_images"."id" ASC LIMIT ?  [["food_id", 7], ["LIMIT", 1]]

					<%= link_to detail_cat_path(id: cat.id) do %>
						<% if cat.cat_images.first %>
							<%= image_tag(cat.cat_images.first.link, style:"width:90%; height:150px; object-fit:cover") %>
---
SELECT  "cat_images".* FROM "cat_images" WHERE "cat_images"."cat_id" = ? ORDER BY "cat_images"."id" ASC LIMIT ?  [["cat_id", 2], ["LIMIT", 1]]