app/views/carts/show.html.erb

SELECT "cat_items".* FROM "cat_items" WHERE "cat_items"."cart_id" = ?  [["cart_id", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 1]]
---
	<div class="product">
		<% if @cart.line_items.blank? && @cart.cat_items.blank? %>