app/helpers/application_helper.rb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 1]]
---
  def total_cart_items
    total = @cart.line_items.map(&:quantity).sum