app/views/cat_items/_cat_item.html.erb

		<figure class="center">
			<% if cat_item.cat.cat_images.first %>
				<%= image_tag(cat_item.cat.cat_images.first.link, style:"width:100%; height:200px; object-fit:cover") %>
---
SELECT  "cat_images".* FROM "cat_images" WHERE "cat_images"."cat_id" = ? ORDER BY "cat_images"."id" ASC LIMIT ?  [["cat_id", 2], ["LIMIT", 1]]
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]