app/views/foods/_food.html.erb

SELECT "food_images".* FROM "food_images" WHERE "food_images"."food_id" = ?  [["food_id", 1]]
SELECT  1 AS one FROM "food_images" WHERE "food_images"."food_id" = ? LIMIT ?  [["food_id", 1], ["LIMIT", 1]]
---
<div class="center" style="width:30%;">
  	<% if !food.food_images.empty? %>

SELECT "food_images".* FROM "food_images" WHERE "food_images"."food_id" = ?  [["food_id", 1]]
SELECT COUNT(*) FROM "food_images" WHERE "food_images"."food_id" = ?  [["food_id", 1]]
---
			<ol class="carousel-indicators">
			<% num_of_images = food.food_images.count %>