app/views/foods/index.html.erb

SELECT "food_images".* FROM "food_images" WHERE "food_images"."food_id" = ?  [["food_id", 1]]
SELECT COUNT(*) FROM "foods" WHERE (category = 'Main dish')
SELECT  1 AS one FROM "food_images" WHERE "food_images"."food_id" = ? LIMIT ?  [["food_id", 1], ["LIMIT", 1]]
---
		<div class="center" style="width:30%; margin-top:20px">
			<% if !food.food_images.empty? %>

SELECT "food_images".* FROM "food_images" WHERE "food_images"."food_id" = ?  [["food_id", 1]]
SELECT COUNT(*) FROM "food_images" WHERE "food_images"."food_id" = ?  [["food_id", 1]]
---
					<ol class="carousel-indicators">
					<% num_of_images = food.food_images.count %>