app/controllers/cat_items_controller.rb

SELECT "cat_items".* FROM "cat_items"
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "cat_items" ("cat_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["cat_id", 2], ["cart_id", 1], ["created_at", "2019-11-25 07:21:57.243407"], ["updated_at", "2019-11-25 07:21:57.243407"]]
---
  def create
	@cat_items = CatItem.all
	cat = Cat.find(params[:cat_id])
	if @cat_items.blank?
		@cat_item = @cart.add_cat(cat)

		respond_to do |format|
			if @cat_item.save

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cat_items" WHERE "cat_items"."id" = ?  [["id", 7]]
---
  def destroy
	@cart = Cart.find(session[:cart_id])
    @cat_item.destroy

SELECT  "cat_items".* FROM "cat_items" WHERE "cat_items"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def set_cat_item
      @cat_item = CatItem.find(params[:id])