app/controllers/foods_controller.rb

SELECT  "foods".* FROM "foods" WHERE (category = 'Main dish') LIMIT ? OFFSET ?  [["LIMIT", 6], ["OFFSET", 0]]
SELECT COUNT(*) FROM "foods" WHERE (category = 'Main dish')
---
  def index
	@foods = Food.get_category(params[:category]).page(params[:page]).per Settings.per_page_item