app/controllers/line_items_controller.rb

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "line_items" ("food_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["food_id", 2], ["cart_id", 2], ["created_at", "2019-11-25 05:41:04.560655"], ["updated_at", "2019-11-25 05:41:04.560655"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2019-11-25 07:32:59.500157"], ["id", 1]]
---
  def create
	food = Food.find(params[:food_id])
    @line_item = @cart.add_food(food)

    respond_to do |format|
      if @line_item.save

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 1]]
---
  def destroy
    @cart = Cart.find(session[:cart_id])
    @line_item.destroy