app/controllers/static_pages_controller.rb

  def cat
	@cats = Cat.page(params[:page]).per Settings.per_page_item
---
SELECT  "cats".* FROM "cats" LIMIT ? OFFSET ?  [["LIMIT", 6], ["OFFSET", 0]]
SELECT COUNT(*) FROM "cats"

  def food
	@foods = Food.page(params[:page]).per Settings.per_page_item
---
SELECT  "foods".* FROM "foods" LIMIT ? OFFSET ?  [["LIMIT", 6], ["OFFSET", 0]]
SELECT COUNT(*) FROM "foods"

  def detail_cat
	@cat = Cat.find_by id: params[:id]
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def detail_food
	@food = Food.find_by id: params[:id]
---
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]