app/models/cat.rb

SELECT  "cats".* FROM "cats" ORDER BY "cats"."point" DESC LIMIT ?  [["LIMIT", 3]]
---
	scope :suggest_cats, ->{order(point: :desc).take(3)}