app/models/food.rb

SELECT  "foods".* FROM "foods" ORDER BY "foods"."point" DESC LIMIT ?  [["LIMIT", 3]]
---
	scope :suggest_foods, ->{order(point: :desc).take(3)}