app/views/cats/_cat.html.erb

<div class="center" style="width:30%;">
  	<% if !cat.cat_images.empty? %>
---
SELECT "cat_images".* FROM "cat_images" WHERE "cat_images"."cat_id" = ?  [["cat_id", 1]]
SELECT  1 AS one FROM "cat_images" WHERE "cat_images"."cat_id" = ? LIMIT ?  [["cat_id", 1], ["LIMIT", 1]]

			<ol class="carousel-indicators">
				<% num_of_images = cat.cat_images.count %>
---
SELECT "cat_images".* FROM "cat_images" WHERE "cat_images"."cat_id" = ?  [["cat_id", 1]]
SELECT COUNT(*) FROM "cat_images" WHERE "cat_images"."cat_id" = ?  [["cat_id", 1]]