app/views/line_items/_line_item.html.erb

SELECT  "food_images".* FROM "food_images" WHERE "food_images"."food_id" = ? ORDER BY "food_images"."id" ASC LIMIT ?  [["food_id", 3], ["LIMIT", 1]]
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
		<figure class="center">
			<% if line_item.food.food_images.first %>
				<%= image_tag(line_item.food.food_images.first.link, style:"width:100%; height:200px; object-fit:cover") %>